Revit 2027 API
Material.CutForegroundPatternColor Property
 The color of the material cut foreground pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color CutForegroundPatternColor { get; set; }
Public Property CutForegroundPatternColor As Color
	Get
	Set
public:
property Color^ CutForegroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
member CutForegroundPatternColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace